{"id":1006,"date":"2019-03-13T12:23:04","date_gmt":"2019-03-13T12:23:04","guid":{"rendered":"http:\/\/codes.livemyidea.com\/?page_id=1006"},"modified":"2022-03-09T17:23:53","modified_gmt":"2022-03-09T11:53:53","slug":"terms-conditions","status":"publish","type":"page","link":"https:\/\/www.codesforever.com\/terms-conditions\/","title":{"rendered":"Terms &amp; Conditions"},"content":{"rendered":"<p>[vc_row optreading=&#8221;true&#8221; css=&#8221;.vc_custom_1630145350194{margin-top: -20px !important;padding-top: 30px !important;padding-bottom: 30px !important;background-color: #f0f8ff !important;}&#8221;][vc_column][vc_custom_heading text=&#8221;TERMS &amp; CONDITIONS&#8221; font_container=&#8221;tag:h1|font_size:26px|text_align:center&#8221; use_theme_fonts=&#8221;yes&#8221;][\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text]<strong>TERMS &amp; CONDITIONS AND ANY OTHER LEGAL AGREEMENTS THAT APPLY TO YOU AS A CODESFOREVER ACCOUNT HOLDER.<\/strong><\/p>\n<p><strong>Note:-<\/strong> Please read and accept all the terms and condition mention blew before making any Purchases. On buying the product from us means you may agree all the terms and conditions mention below:-<\/p>\n<ul>\n<li>codesforever.com reserves the right to delay or decline purchases for any reason.<\/li>\n<li>Limits may apply to the amount and number of programs you can buy.<\/li>\n<li>Electronic delivery only (keys will not be physically delivered).<\/li>\n<li>Codesforever.com is not responsible for any loss or damage resulting from lost or stolen programs or use without permission.<\/li>\n<li>Codesforever.com makes no warranties, express or implied, with respect to the Digital programs and disclaims any warranty to the fullest extent available.<\/li>\n<li>No returns or refunds accepted. For any technical disputes with any games publisher, you release, Codesforever.com (and its affiliates and subsidiaries, officers, directors, employees template of an essay and agents) from any and all claims connected with such dispute.<\/li>\n<li>We usually send the key to buyer within 24 Hrs on their email, but some time it will delays from 48-72 Hrs. in that case please contact us.<\/li>\n<li>All the programmed keys and download link is tasted before delivering.<\/li>\n<li>It is strongly advise to check your computer`s hardware and software compatibility before buying software.<\/li>\n<li>It is strongly recommended to read and follow the instructions sent to you by email in order to get successful installation and activation of product.<\/li>\n<li>No cancellation and returns will be accepted if buyers buys and return the product stating that buyer in mistake or no longer needed.<\/li>\n<li>Please be double sure that you need this product before buying.<\/li>\n<li>If product Does not activate or install , do contact us , and cooperate with us to get product install and activate it successfully.<\/li>\n<li>It is highly recommended to uninstall all the previous version of software that you have buyer , if were installed on your computer.<\/li>\n<li>Remote Access of buyer computer may be demanded to troubleshoot problems with installation and activation of product.<\/li>\n<li>Your Contact information such as Phone Number, email address may be used to contact you if you have any problem with installation and activation of product.<\/li>\n<\/ul>\n<p>Programs are hosted on servers and are made available for use over the internet via client software or web page links (“Developer Platforms”). Most Programs available via the Online Shop are licensed to you by third-party Publishers. Programs available through the Online Shop are at no charge and others for a price, as per Program product detail pages. From time to time, promotions such as sales and giveaways promotions may be offered via the Online Shop. Any promotions may be modified or discontinued at any time without prior notice.<\/p>\n<ol>\n<li><strong> GENERAL<\/strong><\/li>\n<\/ol>\n<p><strong>1.1. ALTERATIONS<\/strong> We may modify, suspend or discontinue the Online Shop, in whole or in part, at any time without notice.<\/p>\n<p><strong>1.2. GEOGRAPHIC LIMITATIONS<\/strong> The Online Shop is currently available in North America<\/p>\n<p><strong>1.3 INTERRUPTION AND CLOSURE WAIVER<\/strong> Your rights under this Agreement will automatically terminate without notice and without refund of any fees if you fail to comply with its terms. We may terminate the Agreement or restrict, suspend or terminate your use of the Online Shop at our discretion without notice at any time, including if we determine that your use violates the Agreement, is improper, or otherwise involves fraud or misuse of the Online Shop or harms our interests or those of another user of the Online Shop. Our failure to insist upon or enforce your strict compliance with the Agreement will not constitute a waiver of any of our rights. We may amend the Agreement at our sole discretion by posting the revised terms in the Online Shop or on Codesforever.com. Your continued use of the Online Shop or Online Shop Software after any amendment evidences your agreement to be bound by it.<\/p>\n<p><strong>1.4. SITE USES<\/strong> Codesforever.com is strictly designed for consumer use only. Any purchase that we deem not for personal use may be cancelled, declined or refunded without explanation.<\/p>\n<ol start=\"2\">\n<li><strong> PROGRAMS<\/strong><\/li>\n<\/ol>\n<p><strong>2.1 SUMMARY<\/strong> Upon payment for an Program you may download and access a copy of that Program, as applicable, for personal use. It is the buyers responsibility to ensure, before purchase, that his device meets any minimum system requirements, including any requirement made available on the Program product detail pages. Some Programs, will require the input of a license key as made available in order to install or activate the Program. The buyer is responsible for any internet or other connection charges incurred in connection with a download, access, and use of the Online Shop and any Programs, including any free trial versions.<\/p>\n<p><strong>2.2 SAMPLE PERIODS<\/strong> Free trial and other limited versions of Programs may be offered to preview Programs prior to purchase. These versions may have limited features, may restrict permitted time of use, and may contain other limitations.<\/p>\n<p><strong>2.3. DEVELOPERS\/GAME HOSTS<\/strong> In order to access or use some Developer Platforms or Add-On Keys, you may be required to create an account with the applicable Publisher or other third party (such as a game platform provider) and you may need to link that account to your Codesforever.com account. Any information you provide to the Publisher or other third party will be subject to the Publisher’s or third party’s privacy policy or similar terms, and will not be subject to the Codesforever.com Privacy Notice.<\/p>\n<p><strong>2.4 ADD-ON KEYS &amp; SUBSCRIPTIONS<\/strong> Add-On Keys are subject to any use, access and other restrictions described on the Add-On Product detail page or otherwise provided in the Agreement. Some Add-On Keys are consumables, such as virtual currency, and can be downloaded once only and used on only one device. If you beautiful russian brides purchase an Add-On Product that is a subscription or start a free trial for such a subscription, unless you set your subscription settings to not automatically renew, we may automatically continue your subscription at the regular subscription price using a payment method we have on record for you.<\/p>\n<p><strong>2.5 DEVELOPER PLATFORMS<\/strong> Developer Platforms are hosted and maintained by the applicable Publisher or another third party. We do not guarantee that any Developer Platform will be available or remain available to you, and we are not responsible for any downtime of a Developer Platform.<\/p>\n<p><strong>2.6 SALES AGREEMENT<\/strong> All purchases of Programs are final. We do not accept returns of Programs. Once you purchase an Program and we, or the Publisher make it available to you, you are responsible for downloading (if applicable) and confirming your ability to access Programs, including retrieving the license key for the Program if applicable, and bear all risk of loss thereafter, including any loss due to a computer or hard drive malfunction. If you are unable to complete a download or access a Program, please contact Codesforever.com customer service for assistance.<\/p>\n<p><strong>2.7 AGE RESTRICTIONS<\/strong> We may provide age and content ratings for Programs that Publishers or third parties provide to us. Whilst we require Publishers to provide accurate information regarding the content of their Programs, we cannot ensure that Program ratings are accurate or that Programs do not include content that is offensive, indecent, or objectionable. We accept no liability for any Program content that you find to be offensive, indecent or objectionable.[\/vc_column_text][\/vc_column][\/vc_row]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>[vc_row optreading=&#8221;true&#8221; css=&#8221;.vc_custom_1630145350194{margin-top: -20px !important;padding-top: 30px !important;padding-bottom: 30px !important;background-color: #f0f8ff !important;}&#8221;][vc_column][vc_custom_heading text=&#8221;TERMS &amp; CONDITIONS&#8221; font_container=&#8221;tag:h1|font_size:26px|text_align:center&#8221; use_theme_fonts=&#8221;yes&#8221;][\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text]TERMS &amp; CONDITIONS AND ANY OTHER LEGAL AGREEMENTS THAT APPLY TO YOU AS A CODESFOREVER ACCOUNT HOLDER. Note:- Please read and accept all the terms and condition mention blew before making any Purchases. On buying the product from us means you [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.codesforever.com\/wp-json\/wp\/v2\/pages\/1006"}],"collection":[{"href":"https:\/\/www.codesforever.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.codesforever.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.codesforever.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.codesforever.com\/wp-json\/wp\/v2\/comments?post=1006"}],"version-history":[{"count":10,"href":"https:\/\/www.codesforever.com\/wp-json\/wp\/v2\/pages\/1006\/revisions"}],"predecessor-version":[{"id":7223,"href":"https:\/\/www.codesforever.com\/wp-json\/wp\/v2\/pages\/1006\/revisions\/7223"}],"wp:attachment":[{"href":"https:\/\/www.codesforever.com\/wp-json\/wp\/v2\/media?parent=1006"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}